app/controllers/links_controller.rb

INSERT INTO "links" ("original_url", "short_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
    def create
        @link = Link.new(link_params)
        if @link.original_url != ""
          @link.save

SELECT "links".* FROM "links" WHERE "links"."short_url" = $1 LIMIT $2  [["short_url", "links"], ["LIMIT", 11]]
UPDATE "links" SET "clicked" = $1, "updated_at" = $2 WHERE "links"."id" = $3  [["clicked", 1], ["updated_at", "2021-04-22 17:00:50.635966"], ["id", 43]]
---
    def show
        @link = Link.where(:short_url => params[:short_url]).last
        @link.update_attribute(:clicked, @link.clicked + 1)