app/controllers/links_controller.rb

    def show
        @link = Link.where(:short_url => params[:short_url]).last
        @link.update_attribute(:clicked, @link.clicked + 1)
---
UPDATE "links" SET "clicked" = $1, "updated_at" = $2 WHERE "links"."id" = $3  [["clicked", 1], ["updated_at", "2021-04-21 12:34:02.324173"], ["id", 34]]