app/controllers/stats_controller.rb

SELECT "links".* FROM "links" ORDER BY "links"."id" DESC LIMIT $1  [["LIMIT", 1]]
SELECT "links".* FROM "links"
---
  def index
    @links = Link.all
    access_token = "1dbc43d6e98792"
    handler = IPinfo::create(access_token)
    @links.each do |l|